EDT/УТ/src/DataProcessors/ПечатьШтрихкодовПоКомитентам/ПечатьШтрихкодовПоКомитентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьШтрихкодовПоКомитентам</name>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ПечатьСервисныхКодовПоКомитентам/ПечатьСервисныхКодовПоКомитентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПечатьСервисныхКодовПоКомитентам</name>
  <resources>
    <name>Выводить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/DataProcessors/ПечатьШтрихкодовПоКомитентам/ObjectModule.bsl
Процедура Сформировать() Экспорт
	Таб = Новый ТабличныйДокумент;
	
	Мак = ПолучитьМакет("Макет");
	
	
	
	Обл = Мак.ПолучитьОбласть("Строка");
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПечатьСервисныхКодовПоКомитентам.Комитент.Код КАК Код,
	            |	ПечатьСервисныхКодовПоКомитентам.Комитент.Наименование КАК Наименование
	            |ИЗ
	            |	РегистрСведений.ПечатьСервисныхКодовПоКомитентам КАК ПечатьСервисныхКодовПоКомитентам
	            |ГДЕ
	            |	ПечатьСервисныхКодовПоКомитентам.Выводить = ИСТИНА
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ПечатьСервисныхКодовПоКомитентам.Комитент.Приоритет";
				
	Рез = Зап.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Код = Число(Прав(Рез.Код, СтрДлина(Рез.Код) - 5));
		
		Обл.Рисунки.D1.Объект.barcode = "84" + Формат(Код, "ЧЦ=8; ЧВН=; ЧГ="); 
		Обл.Параметры.Комитент = СокрЛП(Рез.Наименование);
		Таб.Вывести(Обл);
	КонецЦикла;	
	
	
	
	Таб.ПолеСверху = 3;
	Таб.ПолеСлева = 3;
	Таб.ПолеСправа = 3;
	Таб.ПолеСнизу = 3;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОтображатьСетку = Ложь;
	
	Таб.Показать();
КонецПроцедуры
